Reports/ДиаграммаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДиаграммаНачислений</Name>
		</Properties>
	</Report>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Reports/ДиаграммаНачислений/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(Диаграмма)
 
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    НачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
    |    ПРЕДСТАВЛЕНИЕ(НачисленияФактическийПериодДействия.Сотрудник) КАК СотрудникПредставление,
    |    НачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
    |    ПРЕДСТАВЛЕНИЕ(НачисленияФактическийПериодДействия.ВидРасчета) КАК ВидРасчетаПредставление,
    |    НачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
    |    НачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
    |    НачисленияФактическийПериодДействия.Результат КАК Результат,
    |    НачисленияФактическийПериодДействия.Регистратор КАК Регистратор,
    |    ПРЕДСТАВЛЕНИЕ(НачисленияФактическийПериодДействия.Регистратор) КАК РегистраторПредставление
    |ИЗ
    |    РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия";
                 
    ВыборкаРезультата = Запрос.Выполнить().Выбрать();
    
    // Запретить обновление диаграммы
    Диаграмма.Обновление = Ложь;
    
    Диаграмма.Очистить();
    Диаграмма.ОтображатьЗаголовок = Ложь;
    
    // Заполнить диаграмму
    Пока ВыборкаРезультата.Следующий() Цикл
        
        // Получить серию, точку и значение для них
        ТекущаяСерия = Диаграмма.УстановитьСерию(ВыборкаРезультата.ВидРасчетаПредставление);
        ТекущаяТочка = Диаграмма.УстановитьТочку(ВыборкаРезультата.СотрудникПредставление);
        ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
        
        // Создать нужные нам интервалы в значении
        ТекущийИнтервал = ТекущееЗначение.Добавить();
        ТекущийИнтервал.Начало = ВыборкаРезультата.ПериодДействияНачало;
        ТекущийИнтервал.Конец = ВыборкаРезультата.ПериодДействияКонец;
        ТекущийИнтервал.Текст = ВыборкаРезультата.РегистраторПредставление;
        ТекущийИнтервал.Расшифровка = ВыборкаРезультата.Регистратор;
        
    КонецЦикла;
    
    // Раскрасить серии своими цветами
    Для Каждого Серия Из Диаграмма.Серии Цикл
        
        // Получаем ссылку на вид расчета для сравнения
        Если Серия.Значение = Строка(ПланыВидовРасчета.ОсновныеНачисления.Оклад) Тогда
            Серия.Цвет = WebЦвета.Желтый;
        ИначеЕсли Серия.Значение = Строка(ПланыВидовРасчета.ОсновныеНачисления.Премия) Тогда
            Серия.Цвет = WebЦвета.Зеленый;
        ИначеЕсли Серия.Значение = Строка(ПланыВидовРасчета.ОсновныеНачисления.Невыход) Тогда
            Серия.Цвет = WebЦвета.Красный;
        КонецЕсли;
        
    КонецЦикла;
    
    // Разрешить обновление диаграммы
    Диаграмма.Обновление = Истина;
    
КонецПроцедуры 
 
&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере(ДиаграммаГанта);
КонецПроцедуры
